#+TITLE: 7 Reverse_integer

# Rust
:PROPERTIES:
:LEVEL: 0
:END:
#+BEGIN_SRC rust
struct Solution {}

impl Solution {
    pub fn reverse(x: i32) -> i32 {
        match x {
            -9..=9 => x,
            _ => {
                let mut reversed_number;
                let mut number = x;
                let mut numbers = Vec::with_capacity(10); // for i32

                while number != 0 {
                    numbers.push(number % 10);
                    number = number / 10;
                }

                if numbers.len() == 10 {
                    if x < 0 {
                        if !Self::no_negative_overflow_check(&numbers) {
                            return 0;
                        }
                    } else {
                        if !Self::no_positive_overflow_check(&numbers) {
                            return 0;
                        }
                    }
                }

                reversed_number = *numbers.first().expect("should have at least one number");
                numbers.into_iter().skip(1).for_each(|number| {
                   reversed_number = reversed_number * 10 + number;
                });

                reversed_number
            }
        }
    }

    fn no_positive_overflow_check(numbers: &[i32]) -> bool {
        let max_int32 = [2,1,4,7,4,8,3,6,4,7];
        for i in 0..10 {
            let local_max = max_int32[i];
            let current_val = numbers[i];

            if current_val < local_max {
                return true
            }

            if current_val > local_max {
                return false
            }
        }

        true
    }

    fn no_negative_overflow_check(numbers: &[i32]) -> bool {
        let min_int32 = [-2,-1,-4,-7,-4,-8,-3,-6,-4,-8];
        for i in 0..10 {
            let local_min = min_int32[i];
            let current_val = numbers[i];

            if current_val > local_min {
                return true
            }

            if current_val < local_min {
                return false
            }
        }

        true
    }
}

fn main() {
    let reversed = Solution::reverse(123456);
    println!("Initial number: 123456, Reversed number: {}", reversed);
}
#+END_SRC

#+RESULTS:
#+begin_example
warning: value assigned to `reversed_number` is never read
  --> src/main.rs:10:25
   |
10 |                 let mut reversed_number = 0;
   |                         ^^^^^^^^^^^^^^^
   |
   = note: `#[warn(unused_assignments)]` on by default
   = help: maybe it is overwritten before being read?

warning: value assigned to `reversed_number` is never read
  --> src/main.rs:10:25
   |
10 |                 let mut reversed_number = 0;
   |                         ^^^^^^^^^^^^^^^
   |
   = note: `#[warn(unused_assignments)]` on by default
   = help: maybe it is overwritten before being read?

Initial number: 123456, Reversed number: 654321
#+end_example
